Autodesk.Revit.DB.IFC.IFCConnectedWallData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.IFC.IFCConnectedWallData.Location
The location for the join.
Since:
2012

Autodesk.Revit.DB.IFC.IFCConnectedWallData.ElementId
The element id to which this element is joined.
Since:
2012

Autodesk.Revit.DB.IFC.IFCConnectedWallData
A class that contains the IFC-specific information about how an element is joined to another element.
Since:
2012